Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: Once a Menu Page has been created, you can set it to the main area with :cpp:expr:`lv_menu_set_page(menu, page)`.
it_it: Una volta creata una Menu Page, è possibile impostarla nell'area principale con :cpp:expr:`lv_menu_set_page(menu, page)`.

source: Once a Menu Page has been created, you can set it to the sidebar with :cpp:expr:`lv_menu_set_sidebar_page(menu, page)`.
it_it: Una volta creata una Menu Page, la si può impostare sulla barra laterale con :cpp:expr:`lv_menu_set_sidebar_page(menu, page)`.

source: Once a Slider is created, it has:
it_it: Una volta creato, uno Slider ha:

source: Once a binding is created, if the subject's value changes (e.g., by adjusting the slider), all bound widgets will be updated automatically.
it_it: Una volta creato un binding, se il valore del soggetto cambia (ad esempio, regolando lo slider), tutti i widget associati verranno aggiornati automaticamente.

source: Once a font is registered, it can be referenced by its name in styles or even ``<api>`` properties:
it_it: Una volta registrato un font, è possibile farvi riferimento tramite il suo nome negli stili o anche nelle proprietà ``<api>``:

source: Once a gesture is recognized or ended, a ``LV_EVENT_GESTURE`` is sent.
it_it: Una volta riconosciuto o terminato un gesto, viene inviato un ``LV_EVENT_GESTURE``.

source: Once a widget has been added to a group, you can find out what group it belongs to using :cpp:expr:`lv_obj_get_group(widget)`.
it_it: Una volta aggiunto un widget a un gruppo, si può scoprire a quale gruppo appartiene usando :cpp:expr:`lv_obj_get_group(widget)`.

source: Once an SD memory card is connected to the SPI interface of the Arduino or Genuino board, you can create files and read from, and write to them.
it_it: Una volta collegata una scheda di memoria SD all'interfaccia SPI della scheda Arduino o Genuino, è possibile creare file, leggerli e scriverci sopra.

source: Once created, a Display object remembers the characteristics of the display hardware it is representing, as well as other things relevant to its lifetime:
it_it: Una volta creato, un oggetto Display ricorda le caratteristiche dell'hardware di visualizzazione che rappresenta, così come altri elementi rilevanti per la sua durata:

source: Once deleted, the RAM a Widget occupies is freed.
it_it: Una volta eliminato, la RAM occupata da un Widget viene liberata.

source: Once enabled in ``lv_conf.h`` by setting :c:macro:`LV_USE_GIF` to ``1``, :cpp:expr:`lv_gif_create(parent)` can be used to create a gif widget.
it_it: Una volta abilitato in ``lv_conf.h`` impostando :c:macro:`LV_USE_GIF` a ``1``, :cpp:expr:`lv_gif_create(parent)` può essere utilizzato per creare un widget GIF.

source: Once enabled, several things change:
it_it: Una volta abilitata, diverse cose cambiano:

source: Once enabled, the Windows driver can be used like this:
it_it: Una volta abilitato, il driver Windows può essere utilizzato in questo modo:

source: Once it is uploaded, it will stay in RAM_G until reset.
it_it: Una volta caricato, rimarrà nella RAM_G fino al reset.

source: Once it's installed, a small window will appear showing the style properties of the selected element.
it_it: Una volta installato, apparirà una piccola finestra che mostra le proprietà di stile dell'elemento selezionato.

source: Once media is loaded (LV_EVENT_READY), you can access:
it_it: Una volta caricato il contenuto multimediale (LV_EVENT_READY), è possibile accedere a:

source: Once rendering is has been completed, the content of the draw buffer is sent to the display using a Flush Callback function.
it_it: Una volta completato il rendering, il contenuto del buffer di disegno viene inviato al display tramite una funzione di Callback Flush.

source: Once the *live, running* Animation reaches completion, it is automatically deleted from the list of running Animations.
it_it: Una volta completata, l'Animazione *live, in esecuzione* viene automaticamente eliminata dall'elenco delle Animazioni in esecuzione.

source: Once the IDF project and the LVGL component have been configured, all the early initialization process inside of the code will be ready to use, however the user should manually start the LVGL subsystem for IDF by calling `bsp_display_start()`, or `lvgl_port_init()` if LVGL was manually configured, for example without using the `esp_bsp` component.
it_it: Una volta configurati il ​​progetto IDF e il componente LVGL, tutto il processo di inizializzazione all'interno del codice sarà pronto per l'uso; tuttavia, l'utente dovrà avviare manualmente il sottosistema LVGL per IDF chiamando `bsp_display_start()`, o `lvgl_port_init()` se LVGL è stato configurato manualmente, ad esempio senza utilizzare il componente `esp_bsp`.

source: Once the LVGL Editor is open, you can create and edit LVGL XML files as usual.
it_it: Una volta aperto l'editor LVGL, è possibile creare e modificare i file XML LVGL come di consueto.

source: Once the ``.config`` is created, run cmake with the ``-DLV_USE_KCONFIG=ON`` flag:
it_it: Una volta creato il file ``.config``, eseguire cmake con il flag ``-DLV_USE_KCONFIG=ON``:

source: Once the ``lv_conf.h`` file is in place, you can modify this header to configure LVGL's behavior, disable unused modules and features, adjust the size of buffers, etc.
it_it: Una volta installato il file ``lv_conf.h``, è possibile modificare questo header per configurare il comportamento di LVGL, disabilitare moduli e funzionalità inutilizzati, regolare la dimensione dei buffer, ecc.

source: Once the data is saved, each Component can be registered, and instances can be created after that.
it_it: Una volta salvati i dati, ogni Componente può essere registrato e successivamente possono essere create istanze.

source: Once the layer is created, draw tasks can be added to it by using the :ref:`Draw API <draw_api>` and :ref:`Draw descriptors <draw_descriptors>`.
it_it: Una volta creato il layer, è possibile aggiungervi task di disegno utilizzando :ref:`API di Disegno <draw_api>` e :ref:`Descrittori di disegno <draw_descriptors>`.

source: Once the recognizers are updated, calling :cpp:expr:`lv_indev_gesture_recognizers_set_data(indev, data)` will update the :cpp:expr:`lv_indev_data_t` structure.
it_it: Una volta aggiornati i riconoscitori, la chiamata a :cpp:expr:`lv_indev_gesture_recognizers_set_data(indev, data)` ggiornerà la struttura :cpp:expr:`lv_indev_data_t`.

source: Once the setup is complete, the device will boot into TorizonOS.
it_it: Una volta completata la configurazione, il dispositivo si avvierà in TorizonOS.

source: Once translations are registered, use:
it_it: Una volta registrate le traduzioni, si usa:

source: Once you are ready to work on your own project, you should remove those lines so only your project sources are compiled.
it_it: Quando si è pronti a lavorare sul progetto, si devono rimuovere queste righe in modo che vengano compilati solo i sorgenti del progetto.

source: Once you have ``pre-commit`` installed you will need to `set up the git hook scripts <https://pre-commit.com/#3-install-the-git-hook-scripts>`__ with:
it_it: Una volta installato ``pre-commit`` si dovranno `configurare gli script degli hook di git <https://pre-commit.com/#3-install-the-git-hook-scripts>`__ con:

source: Once you have the appropriate symbol set to ``1`` in ``lv_conf.h``, to use a file, simply make the file accessible on an external storage device.
it_it: Una volta impostato il simbolo appropriato su ``1`` in ``lv_conf.h``, per utilizzare un file, è sufficiente renderlo accessibile su un dispositivo di archiviazione esterno.

source: Once your configuration file is ready, update ``lv_conf.h`` to include it, for example:
it_it: Una volta pronto il file di configurazione, aggiornare ``lv_conf.h`` per includerlo, ad esempio:

source: One Buffer
it_it: Un Buffer

source: One RTOS Task handles all LVGL calls
it_it: Un task RTOS gestisce tutte le chiamate LVGL

source: One can save a defconfig using the ``savedefconfig`` command:
it_it: È possibile salvare un defconfig utilizzando il comando ``savedefconfig``:

source: One checked
it_it: Uno selezionato

source: One core is dedicated to EtherCAT so the other is free for application logic.
it_it: Un core è dedicato a EtherCAT, quindi l'altro è libero per la logica applicativa.

source: One core is typically high performance while the other is high efficiency.
it_it: Un core è in genere ad alte prestazioni, mentre l'altro ad alta efficienza.

source: One example is a label whose color is set to a random value every frame, as in the "Multiple labels" scene of the benchmark demo.
it_it: Un esempio è un'etichetta il cui colore è impostato su un valore casuale per ogni fotogramma, come nella scena "Multiple labels" della demo del benchmark.

source: One frame buffer in the MCU or in an external display controller
it_it: Un frame buffer nell'MCU o in un controller video esterno

source: One line, one declaration (BAD: char x, y;).
it_it: Una riga, una dichiarazione (DA NON FARE: char x, y;).

source: One might think you can use a fake MS Bitmap only sfnt (ttf) (TTF without outlines) created by fontforge, but this will not work.
it_it: Si potrebbe pensare di poter usare un finto MS Bitmap solo sfnt (ttf) (TTF senza contorni) creato da fontforge, ma non funzionerà.

source: One notable port is to "Unix", which allows you to build and run MicroPython (+LVGL) on a Linux machine.
it_it: Una versione degna di nota è quella per "Unix", che consente di compilare ed eseguire MicroPython (+LVGL) su una macchina Linux.

source: One of its powerful features is the ability to change the behavior of a device by changing the Python code on removable (or internal) storage, without having to change the device's firmware.
it_it: Una delle sue potenti funzionalità è la possibilità di modificare il comportamento di un dispositivo modificando il codice Python su una memoria rimovibile (o interna), senza dover modificare il firmware del dispositivo.

source: One of its primary role is to serve as support for the Pixel Processor Accelerator the PPA, being used to copy the source image data to the desired PPA client splitting these data into fixed size blocks, called bursts.
it_it: Uno dei suoi ruoli principali è quello di supportare il Pixel Processor Accelerator (PPA), utilizzato per copiare i dati dell'immagine sorgente sul client PPA desiderato, suddividendoli in blocchi di dimensioni fisse, chiamati "burst".

source: One of our firm policies is EVERYTHING MUST BE DOCUMENTED.
it_it: Una delle nostre politiche aziendali è TUTTO DEVE ESSERE DOCUMENTATO.

source: One of them must be enabled to use LZ4 decompression.
it_it: Una di queste deve essere abilitata per utilizzare la decompressione LZ4.

source: One option is to use a free online PNG compressor site, for example Compress PNG: https://compresspng.com/
it_it: Un'opzione è quella di utilizzare un sito online gratuito per la compressione dei file PNG, ad esempio Compress PNG: https://compresspng.com/

source: One way to get it in your C app is to convert the binary file to a C array.
it_it: Un modo per ottenerlo nell'app C è convertire il file binario in un array C.

source: One-line mode
it_it: Modalità a una riga

source: One-line mode and password modes are supported.
it_it: Sono supportate la modalità a riga singola e la modalità password.

source: Online Converter
it_it: Convertitore Online

source: Online Share
it_it: Condivisione Online

source: Online Share is a complementary tool for LVGL's Editor to make it easy to share the developed UIs.
it_it: Online Share è uno strumento complementare all'Editor di LVGL per semplificare la condivisione delle interfacce utente sviluppate.

source: Online Share is available at https://viewer.lvgl.io
it_it: Online Share è disponibile all'indirizzo https://viewer.lvgl.io

source: Online Share is available for public repositories for free.
it_it: Online Share è disponibile gratuitamente per i repository pubblici.

source: Online Share supports all Editor features (Subjects, Translations, Animations, etc.) except compiling code, so that the modifications of the C code cannot be applied.
it_it: Online Share supporta tutte le funzionalità dell'Editor (Soggetti, Traduzioni, Animazioni, ecc.) tranne la compilazione del codice, in modo che le modifiche al codice C non possano essere applicate.

source: Online Simulator
it_it: Simulatore Online

source: Online share/preview for collaboration and testing
it_it: Condivisione/anteprima online per collaborazione e test

source: Only 4 bpp fonts are supported for now.
it_it: Per ora sono supportati solo i font a 4 bpp.

source: Only :ref:`generic events <events>` are sent by Line Widgets.
it_it: I Widget Line inviano solo :ref:`eventi generici <events>`.

source: Only ``text_color`` and ``bg_color`` style properties can be used.
it_it: È possibile utilizzare solo le proprietà di stile ``text_color`` e ``bg_color``.

source: Only a skeleton is exported once
it_it: Lo scheletro viene esportato una sola volta

source: Only baseline JPEG files are supported (no progressive JPEG support).
it_it: Sono supportati solo i file JPEG di base (nessun supporto per JPEG progressivi).

source: Only call :cpp:expr:`lv_event_get_target_obj(e)` when the event target is known to be a Widget.
it_it: Chiamare :cpp:expr:`lv_event_get_target_obj(e)` solo quando si sa che il target dell'evento è un Widget.

source: Only currently created (existing) Widgets consume RAM.
it_it: Solo i widget attualmente creati (esistenti) consumano RAM.

source: Only displaying text is supported (e.g. on labels), i.e. text inputs (e.g. Text Area) do not support this feature.
it_it: È supportata solo la visualizzazione del testo (ad esempio sulle etichette), gli input di testo (ad esempio, Text Area) non supportano questa funzionalità.

source: Only integer ``step`` values are supported now.
it_it: Ora sono supportati solo valori ``step`` interi.

source: Only multiples of ten can be set.
it_it: È possibile impostare solo multipli di dieci.

source: Only one direction is scrolled and horizontal scrolling has higher precedence.
it_it: Lo scorrimento avviene in una sola direzione e quello orizzontale ha la precedenza.

source: Only pixel values can be used.
it_it: Possono essere utilizzati solo valori in pixel.

source: Only relevant for pinch gestures.
it_it: Rilevante solo per i gesti di "pinch" [pizzico].

source: Only relevant for rotation gestures.
it_it: Rilevante solo per i gesti di rotazione.

source: Only relevant for two-finger swipe gestures.
it_it: Rilevante solo per i gesti di "swipe" [scorrimento] a due dita.

source: Only simple properties that are forwarded are supported.
it_it: Sono supportate solo le proprietà semplici inoltrate.

source: Only the array's pointer is saved in the series so its contents need to remain available for the life of the series, i.e. the array needs to be global, static or dynamically allocated.
it_it: Solo il puntatore dell'array viene salvato nella serie, quindi, il suo contenuto deve rimanere disponibile per tutta la durata della serie, ovvero l'array deve essere globale, statico o allocato dinamicamente.

source: Only the array's pointer will be saved so the array should be have static or global scope.
it_it: Verrà salvato solo il puntatore dell'array, quindi l'array deve avere uno scope statico o globale.

source: Only the required portions of the JPEG images are decoded, therefore they cannot be zoomed or rotated.
it_it: Vengono decodificate solo le porzioni richieste delle immagini JPEG, pertanto non è possibile ingrandirle o ruotarle.

source: Only the selected widgets will be focusable, and the order of receiving focus will be the order in which the widgets were added.
it_it: Solo i widget selezionati saranno attivabili e l'ordine di attivazione sarà lo stesso in cui sono stati aggiunti.

source: Only the upper part of the display is refreshed.
it_it: Viene aggiornata solo la parte superiore del display.

source: Only their pointer is saved in the Widgets so they need to be defined as static or global variables.
it_it: Solo il loro puntatore viene salvato nei Widget, quindi devono essere definiti come variabili statiche o globali.

source: Only uncompressed BMP files are supported.
it_it: Sono supportati solo file BMP non compressi.

source: Only use it when you specifically need global coordinates.
it_it: Utilizzarla solo quando sono specificamente necessarie le coordinate globali.

source: Only used if ``anim_type`` is not ``"none"``.
it_it: Utilizzato solo se ``anim_type`` non è ``"none"``.

source: Only used with Widgets, this tag defines enums for parameter values.
it_it: Utilizzato solo con i Widget, questo tag definisce gli enum per i valori dei parametri.

source: Only widgets added to a group can be selected by a keyboard.
it_it: Solo i widget aggiunti a un gruppo possono essere selezionati tramite tastiera.

source: Opacity
it_it: Opacità

source: Opacity (0--255 range).
it_it: Opacità (intervallo 0-255).

source: Opacity and Transformations
it_it: Opacità e trasformazioni

source: Opacity in the 0--255 range.
it_it: Opacità compresa tra 0 e 255.

source: Opacity value in the range of 0 to 255 or 0 to 100%.
it_it: Valore di opacità compreso tra 0 e 255 o tra 0 e 100%.

source: Open PIO Home by clicking the PlatformIO icon in the left toolbar.
it_it: Aprire PIO Home cliccando sull'icona di PlatformIO nella toolbar a sinistra.

source: Open ``alif_m55-lvgl`` in VS Code
it_it: Apertura di ``alif_m55-lvgl`` in VS Code

source: Open ``conf/bblayers.conf`` file and add manually the paths:
it_it: Aprire il file ``conf/bblayers.conf`` e aggiungere manualmente i path:

source: Open ``lv_conf.h`` and change the first ``#if 0`` to ``#if 1`` to enable the content of the file
it_it: Aprire ``lv_conf.h`` e modificare il primo ``#if 0`` in ``#if 1`` per abilitare il contenuto del file

source: Open a BMP image from file
it_it: Aprire un'immagine BMP da file

source: Open a GIF image from file and variable
it_it: Aprire un'immagine GIF da file e variabile

source: Open a PNG image from file and variable
it_it: Aprire un'immagine PNG da file e variabile

source: Open a Terminal and type ``wsl.exe --list --verbose`` to see if it's already installed.
it_it: Aprire un Terminale e digitare ``wsl.exe --list --verbose`` per verificare se è già installato.

source: Open a WEBP image from file and variable
it_it: Aprire un'immagine WEBP da file e variabile

source: Open a demo
it_it: Aprire una demo

source: Open a font with Tiny TTF from data array
it_it: Aprire un font con Tiny TTF da un array di dati

source: Open a glTF from a file and iterate through each camera
it_it: Aprire un GLTF da un file e iterare attraverso ogni telecamera

source: Open a glTF from a file and make it spin forever like a platter
it_it: Aprire un GLTF da un file e farlo girare all'infinito come un piatto

source: Open a image and generate decoded image [1]_
it_it: Apre un'immagine e genera l'immagine decodificata [1]_

source: Open an existing project
it_it: Aprire un progetto esistente

source: Open an image:
it_it: Apre un'immagine:

source: Open any recent project
it_it: Aprire un progetto recente

source: Open callback
it_it: Callback Open

source: Open e2 Studio.
it_it: Aprire e2 Studio.

source: Open e\ |sup2| studio, go to ``File`` -> ``Import project`` and select ``General`` / ``Existing projects into workspace``
it_it: Aprire e\ |sup2| studio, andare su ``File`` -> ``Import project`` e selezionare ``General`` / ``Existing projects into workspace``

source: Open e\ |sup2| studio, go to ``File`` -> ``Import project`` and select ``General`` / ``Existing projects into workspace``.
it_it: Aprire e\ |sup2| studio, andare su ``File`` -> ``Import project`` e selezionare ``General`` / ``Existing projects into workspace``.

source: Open the `Online font converter <https://lvgl.io/tools/fontconverter>`__.
it_it: Aprire il `Convertitore di font online <https://lvgl.io/tools/fontconverter>`__.

source: Open the `board.h file <https://github.com/alifsemi/alif_vscode-template/blob/ce5423dbd15f62cb0aa4462533a960d79a014f97/board/board.h#L23-L30>`__.
it_it: Aprire il file `board.h <https://github.com/alifsemi/alif_vscode-template/blob/ce5423dbd15f62cb0aa4462533a960d79a014f97/board/board.h#L23-L30>`__.

source: Open the cloned repo in VS Code.
it_it: Aprire il repository clonato in VS Code.

source: Open the dropdown again and choose "Program with Security Toolkit".
it_it: Aprire di nuovo il menù a discesa e selezionare "Program with Security Toolkit".

source: Open the dropdown from before and choose "Prepare program with Security Toolkit".
it_it: Aprire il menù a discesa precedente e selezionare "Prepare program with Security Toolkit".

source: Open the file in a text editor.
it_it: Aprire il file in un editor di testo.

source: Open the terminal and run `./build_all.sh`.
it_it: Aprire il terminale ed eseguire `./build_all.sh`.

source: Open this project with CMake GUI and select your desired preset.
it_it: Aprire questo progetto con l'interfaccia grafica di CMake e selezionare il preset desiderato.

source: OpenGL (Open Graphics Library) is a cross-platform, hardware-accelerated graphics API that provides a standardized interface for rendering 2D and 3D graphics.
it_it: OpenGL (Open Graphics Library) è un'API grafica multipiattaforma con accelerazione hardware che fornisce un'interfaccia standardizzata per il rendering di grafica 2D e 3D.

source: OpenGL Display Drivers: Handle output by showing the LVGL rendered content on the display, window, or texture in OpenGL-based environments
it_it: OpenGL Display Drivers: Gestiscono l'output mostrando il contenuto renderizzato LVGL sul display, sulla finestra o sulla texture in ambienti basati su OpenGL

source: OpenGL Draw Unit: When enabled, LVGL uses OpenGL for hardware-accelerated rendering operations, including texture caching for improved performance
it_it: OpenGL Draw Unit: Se abilitata, LVGL utilizza OpenGL per le operazioni di rendering con accelerazione hardware, incluso il caching delle texture per migliorare le prestazioni

source: OpenGL Driver
it_it: Driver OpenGL

source: OpenGL Driver Options
it_it: Opzioni per il Driver OpenGL

source: OpenGL Overview
it_it: Panoramica su OpenGL

source: OpenGL Support in LVGL
it_it: Supporto OpenGL in LVGL

source: OpenGL Texture Caching Renderer
it_it: Renderer con Cache delle Texture OpenGL

source: OpenGL is the first supported 3D graphics back-end.
it_it: OpenGL è il primo back-end grafico 3D supportato.

source: OpenGL support addresses several key use cases:
it_it: Il supporto OpenGL affronta diversi casi d'uso chiave:

source: Operating system drivers
it_it: Driver del sistema operativo

source: Optimize the execution time of log flushing functions, such as increasing the serial port baud rate or improving file writing speed.
it_it: Ottimizzare il tempo di esecuzione delle funzioni di flushing dei log, ad esempio aumentando la velocità in baud della porta seriale o migliorando la velocità di scrittura dei file.

source: Option 1: ``user_data`` in a struct
it_it: Opzione 1: ``user_data`` in una struct

source: Option 2: ``user_data`` as a function argument
it_it: Opzione 2: ``user_data`` come argomento della funzione

source: Option 3: both callback and ``user_data`` are struct fields
it_it: Opzione 3: sia la callback che ``user_data`` sono campi di struct

source: Optional File Buffering/Caching
it_it: Buffering/caching Opzionale dei File

source: Optional configuration options:
it_it: Opzioni di configurazione facoltative:

source: Optional custom pointer as :ref:`display_user_data`
it_it: Puntatore custom facoltativo come :ref:`display_user_data`

source: Optional dedicated image cache heap
it_it: Heap opzionale della cache immagini dedicato
